perf/heavy/load/load.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: warmup
      duration: 30
      arrivalRate: 5
    - name: Ramp (+)
      duration: 120
      arrivalRate: 5
      rampTo: 60
    - name: Plain
      duration: 30
      arrivalRate: 60
    - name: Ramp (-)
      duration: 20
      arrivalRate: 60
      rampTo: 5
    - name: end
      duration: 30
      arrivalRate: 5

scenarios:
  - name: Heavy
    flow:
      - get:
          url: '/heavy'